Revit 2027 API
Ellipse Properties
The Ellipse type exposes the following members.
Properties
Name | Description
ApproximateLength | The approximate length of the curve.
(Inherited from Curve)
Center | Returns the center of the ellipse.
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
(Inherited from GeometryObject)
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
(Inherited from GeometryObject)
IsBound | Describes whether the parameter of the curve is restricted to a particular interval.
(Inherited from Curve)
IsClosed | Describes whether the curve is closed.
(Inherited from Curve)
IsCyclic | The boolean value that indicates whether this curve is cyclic.
(Inherited from Curve)
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
(Inherited from GeometryObject)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Length | The exact length of the curve.
(Inherited from Curve)
Normal | Returns the normal to the plane in which the ellipse is defined.
Period | The period of this curve.
(Inherited from Curve)
RadiusX | Returns the X vector radius of the ellipse.
RadiusY | Returns the Y vector radius of the ellipse.
Reference | Returns a stable reference to the curve.
(Inherited from Curve)
Visibility | The visibility.
(Inherited from GeometryObject)
XDirection | The X direction.
YDirection | The Y direction.
Top
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace